In [ ]:
# 제목 단위로 처리하는 것 pandas
# 데이터(숫자+문자)를 프레임 단위[테이블 구조]로 처리 -> pandas
# 제목 : 필드
# 머신러닝 딥러닝에서는 데이터 프레임 구조를 받지 않음
# 숫자만 들어올 수 있는 numpy array 구조를 쓰게 됨

In [2]:
from glob import glob
glob('/*.csv')

[]

In [15]:
# 자료중 확장자가 csv인 자료만 읽기
# 지정한 폴더 내의 모든 자료를 읽어서 하나씩 확인
# 사용자가 검색한 글자수만큼(ex : csv)파일의 끝글자를 읽어서 같은 글자가 나온다면
# 해당 파일 명을 배열이나 리스트에 보관하여 return
# glob 명령어가 없다는 조건

import os
folderName='c:/data/'
file_list=os.listdir(folderName)

find='csv'
# txt='AB_NYC_2019 - 복사본.csv'
# #txt[-3:]
# txt[-len(find):]


result=[]
for x in file_list:
    #print(x)
    if find==x[-len(find):]:
        #print(find+'맞음')
        result.append(x)
result

['AB_NYC_2019.csv', 'xAPI-Edu-Data.csv']

In [19]:
import os

def myglob(folderName, find='csv'):
    file_list=os.listdir(folderName)
    result=[]
    for x in file_list:
        if find==x[-len(find):]:
            result.append(folderName+x)
    return result    

folderName='c:/data/'
find='csv'

file=myglob(folderName)
file

['c:/data/AB_NYC_2019.csv', 'c:/data/xAPI-Edu-Data.csv']

In [29]:
import os

class my1():

    def __init__(self):  # 생성자
        print('filelist search')


    def myglob(self, folderName, find='csv'):
        file_list=os.listdir(folderName)
        result=[]
        for x in file_list:
            if find==x[-len(find):]:
                result.append(x)
                #result.append(folderName+x)
        return result    

folderName='c:/data/'
find='csv'

a=my1()
file=a.myglob(folderName, find)
file

filelist search

['AB_NYC_2019.csv', 'xAPI-Edu-Data.csv']

In [31]:
# 사본 파일 만들기

import shutil

sourcefolder='c:/data/'
copyfolder='c:/backup/'

fil=a.myglob(folderName, find)
for x in file:
    print(x)
    shutil.copyfile(sourcefolder+x, copyfolder+x)

# for x in glob(sourcefolder+'*.csv'):
#     shutil.copyfile(sourcefolder+x, copyfolder+x)

AB_NYC_2019.csv
xAPI-Edu-Data.csv

In [ ]:
# 원본폴더, 복사본폴더를 지정해서
# 사용자가 지정한 확장자가 있는 자료만 복사

from shutil
import os

# copyfile(src, dst)
copyfile('C:\\test\\test.txt','C:\\test\\test_copy.txt')

class my1():

    def __init__(self):  # 생성자
        print('filelist search')


    def myglob(self, folderName, find='csv'):  # find copy list
        file_list=os.listdir(folderName)
        result=[]
        for x in file_list:
            if find==x[-len(find):]:
                result.append(folderName+x)
        return result

    def copy_file(self, sourcefolder, copyfolder, find): # copy&paste
        file=self.myglob(folderName.find)
        for x in file:
            print(x)
            shutil.copyfile(sourcefolder+x, copyfolder+x)
        

folderName='c:/data/'
find='csv'
sourcefolder='c:/data/'
copyfolder='c:/backup/'

a=my1()
file=a.myglob(folderName, find)
file

In [34]:
import pandas as pd
df=pd.read_csv('AB_NYC_2019.csv')
display(df.head())

#df.isna().sum() # 결측치
pd.DataFrame(df.isna().sum()).T  # 행열 변환

,id,name,host_id,host_name,neighbourhood_group,neighbourhood,latitude,longitude,room_type,price,minimum_nights,number_of_reviews,last_review,reviews_per_month,calculated_host_listings_count,availability_365
0,2539,Clean & quiet apt home by the park,2787,John,Brooklyn,Kensington,40.64749,-73.97237,Private room,149,1,9,2018-10-19,0.21,6,365
1,2595,Skylit Midtown Castle,2845,Jennifer,Manhattan,Midtown,40.75362,-73.98377,Entire home/apt,225,1,45,2019-05-21,0.38,2,355
2,3647,THE VILLAGE OF HARLEM....NEW YORK !,4632,Elisabeth,Manhattan,Harlem,40.80902,-73.94190,Private room,150,3,0,NaN,NaN,1,365
3,3831,Cozy Entire Floor of Brownstone,4869,LisaRoxanne,Brooklyn,Clinton Hill,40.68514,-73.95976,Entire home/apt,89,1,270,2019-07-05,4.64,1,194
4,5022,Entire Apt: Spacious Studio/Loft by central park,7192,Laura,Manhattan,East Harlem,40.79851,-73.94399,Entire home/apt,80,10,9,2018-11-19,0.10,1,0

,id,name,host_id,host_name,neighbourhood_group,neighbourhood,latitude,longitude,room_type,price,minimum_nights,number_of_reviews,last_review,reviews_per_month,calculated_host_listings_count,availability_365
0,0,16,0,21,0,0,0,0,0,0,0,0,10052,10052,0,0

In [47]:
import pandas as pd


filename='c:/data/AB_NYC_2019.csv'

class my_load():
    def __init__(self,filename): #생성자는 class가 생성되는 순간 생기고 클래스가 종료되면 없어짐
        print(filename+'작업')
        self.filename=filename   # 파일 이름
        self.df=pd.read_csv(self.filename)  # 판다스 로드한 데이터프레임을 생성자에서 가짐

    def load(self):
        #print(self.filename)
        #df=pd.read_csv(self.filename)
        display(self.df.head())

        display(pd.DataFrame(self.df.isna().sum()).T)

        display(self.df.columns)

    def desc(self):
        display(self.df.describe())


a=my_load(filename)
a.desc()
#a.load(filename)

c:/data/AB_NYC_2019.csv작업

,id,host_id,latitude,longitude,price,minimum_nights,number_of_reviews,reviews_per_month,calculated_host_listings_count,availability_365
count,4.889500e+04,4.889500e+04,48895.000000,48895.000000,48895.000000,48895.000000,48895.000000,38843.000000,48895.000000,48895.000000
mean,1.901714e+07,6.762001e+07,40.728949,-73.952170,152.720687,7.029962,23.274466,1.373221,7.143982,112.781327
std,1.098311e+07,7.861097e+07,0.054530,0.046157,240.154170,20.510550,44.550582,1.680442,32.952519,131.622289
min,2.539000e+03,2.438000e+03,40.499790,-74.244420,0.000000,1.000000,0.000000,0.010000,1.000000,0.000000
25%,9.471945e+06,7.822033e+06,40.690100,-73.983070,69.000000,1.000000,1.000000,0.190000,1.000000,0.000000
50%,1.967728e+07,3.079382e+07,40.723070,-73.955680,106.000000,3.000000,5.000000,0.720000,1.000000,45.000000
75%,2.915218e+07,1.074344e+08,40.763115,-73.936275,175.000000,5.000000,24.000000,2.020000,2.000000,227.000000
max,3.648724e+07,2.743213e+08,40.913060,-73.712990,10000.000000,1250.000000,629.000000,58.500000,327.000000,365.000000

In [50]:
a=my_load(filename)
data=a.df
data

c:/data/AB_NYC_2019.csv작업

,id,name,host_id,host_name,neighbourhood_group,neighbourhood,latitude,longitude,room_type,price,minimum_nights,number_of_reviews,last_review,reviews_per_month,calculated_host_listings_count,availability_365
0,2539,Clean & quiet apt home by the park,2787,John,Brooklyn,Kensington,40.64749,-73.97237,Private room,149,1,9,2018-10-19,0.21,6,365
1,2595,Skylit Midtown Castle,2845,Jennifer,Manhattan,Midtown,40.75362,-73.98377,Entire home/apt,225,1,45,2019-05-21,0.38,2,355
2,3647,THE VILLAGE OF HARLEM....NEW YORK !,4632,Elisabeth,Manhattan,Harlem,40.80902,-73.94190,Private room,150,3,0,NaN,NaN,1,365
3,3831,Cozy Entire Floor of Brownstone,4869,LisaRoxanne,Brooklyn,Clinton Hill,40.68514,-73.95976,Entire home/apt,89,1,270,2019-07-05,4.64,1,194
4,5022,Entire Apt: Spacious Studio/Loft by central park,7192,Laura,Manhattan,East Harlem,40.79851,-73.94399,Entire home/apt,80,10,9,2018-11-19,0.10,1,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
48890,36484665,Charming one bedroom - newly renovated rowhouse,8232441,Sabrina,Brooklyn,Bedford-Stuyvesant,40.67853,-73.94995,Private room,70,2,0,NaN,NaN,2,9
48891,36485057,Affordable room in Bushwick/East Williamsburg,6570630,Marisol,Brooklyn,Bushwick,40.70184,-73.93317,Private room,40,4,0,NaN,NaN,2,36
48892,36485431,Sunny Studio at Historical Neighborhood,23492952,Ilgar & Aysel,Manhattan,Harlem,40.81475,-73.94867,Entire home/apt,115,10,0,NaN,NaN,1,27
48893,36485609,43rd St. Time Square-cozy single bed,30985759,Taz,Manhattan,Hell's Kitchen,40.75751,-73.99112,Shared room,55,1,0,NaN,NaN,6,2
48894,36487245,Trendy duplex in the very heart of Hell's Kitchen,68119814,Christophe,Manhattan,Hell's Kitchen,40.76404,-73.98933,Private room,90,7,0,NaN,NaN,1,23

In [51]:
data.columns

Index(['id', 'name', 'host_id', 'host_name', 'neighbourhood_group',
       'neighbourhood', 'latitude', 'longitude', 'room_type', 'price',
       'minimum_nights', 'number_of_reviews', 'last_review',
       'reviews_per_month', 'calculated_host_listings_count',
       'availability_365'],
      dtype='object')

In [52]:
data[['name','host_id']]

                                                    name   host_id
0                     Clean & quiet apt home by the park      2787
1                                  Skylit Midtown Castle      2845
2                    THE VILLAGE OF HARLEM....NEW YORK !      4632
3                        Cozy Entire Floor of Brownstone      4869
4       Entire Apt: Spacious Studio/Loft by central park      7192
...                                                  ...       ...
48890    Charming one bedroom - newly renovated rowhouse   8232441
48891      Affordable room in Bushwick/East Williamsburg   6570630
48892            Sunny Studio at Historical Neighborhood  23492952
48893               43rd St. Time Square-cozy single bed  30985759
48894  Trendy duplex in the very heart of Hell's Kitchen  68119814

[48895 rows x 2 columns]

In [53]:
data[data['host_id']>=5000]  # 해당 조건을 가진 필드만 출력

,id,name,host_id,host_name,neighbourhood_group,neighbourhood,latitude,longitude,room_type,price,minimum_nights,number_of_reviews,last_review,reviews_per_month,calculated_host_listings_count,availability_365
4,5022,Entire Apt: Spacious Studio/Loft by central park,7192,Laura,Manhattan,East Harlem,40.79851,-73.94399,Entire home/apt,80,10,9,2018-11-19,0.10,1,0
5,5099,Large Cozy 1 BR Apartment In Midtown East,7322,Chris,Manhattan,Murray Hill,40.74767,-73.97500,Entire home/apt,200,3,74,2019-06-22,0.59,1,129
6,5121,BlissArtsSpace!,7356,Garon,Brooklyn,Bedford-Stuyvesant,40.68688,-73.95596,Private room,60,45,49,2017-10-05,0.40,1,0
7,5178,Large Furnished Room Near B'way,8967,Shunichi,Manhattan,Hell's Kitchen,40.76489,-73.98493,Private room,79,2,430,2019-06-24,3.47,1,220
8,5203,Cozy Clean Guest Room - Family Apt,7490,MaryEllen,Manhattan,Upper West Side,40.80178,-73.96723,Private room,79,2,118,2017-07-21,0.99,1,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
48890,36484665,Charming one bedroom - newly renovated rowhouse,8232441,Sabrina,Brooklyn,Bedford-Stuyvesant,40.67853,-73.94995,Private room,70,2,0,NaN,NaN,2,9
48891,36485057,Affordable room in Bushwick/East Williamsburg,6570630,Marisol,Brooklyn,Bushwick,40.70184,-73.93317,Private room,40,4,0,NaN,NaN,2,36
48892,36485431,Sunny Studio at Historical Neighborhood,23492952,Ilgar & Aysel,Manhattan,Harlem,40.81475,-73.94867,Entire home/apt,115,10,0,NaN,NaN,1,27
48893,36485609,43rd St. Time Square-cozy single bed,30985759,Taz,Manhattan,Hell's Kitchen,40.75751,-73.99112,Shared room,55,1,0,NaN,NaN,6,2
48894,36487245,Trendy duplex in the very heart of Hell's Kitchen,68119814,Christophe,Manhattan,Hell's Kitchen,40.76404,-73.98933,Private room,90,7,0,NaN,NaN,1,23

In [54]:
data[(data['host_id']>=5000) & (data['host_id']<=6000)]  #복수조건

,id,name,host_id,host_name,neighbourhood_group,neighbourhood,latitude,longitude,room_type,price,minimum_nights,number_of_reviews,last_review,reviews_per_month,calculated_host_listings_count,availability_365
3465,2075600,Delicious & Airy Apt in Landmark Brownstone,5089,Subhana,Brooklyn,Bedford-Stuyvesant,40.68637,-73.9417,Entire home/apt,151,2,43,2019-07-01,0.65,1,220

In [63]:
con=data['neighbourhood_group'].unique()

class dataSave():
    def __init__(self,data,filed):
        self.data=data
        self.filed=filed
        #self.con=data[filed].unique()
        self.findList=self.data[self.filed].unique()
        try:
            #for x in self.con:
            for x in self.findList:
                #print(x)
                os.mkdir('c:/data/'+x)
        except:
            pass

    def save(self):
        for find in self.findList:
            result=data[data['neighbourhood_group']==find]
            result.head()
            result.to_csv('c:/data/'+find+'/'+find+'.csv')



a=dataSave(data, 'neighbourhood_group')
a.save()
# neighbourhood_group에 해당하는 columns 명으로 폴더 생성

In [60]:
#find='Brooklyn'
findList=data['neighbourhood_group'].unique()

for find in findList:
    result=data[data['neighbourhood_group']==find]
    result.head()
    result.to_csv('c:/data/'+find+'.csv')
    # csv생성

In [61]:
data['neighbourhood_group'].unique()

'c:/data/Brooklyn.csv'

In [ ]:
# result=data[data['room_type']==con[0]]
# result.to_csv('c:/data/'+con[0]+'.csv')

for x in con:
    result=data[data['room_type']==x]
    fileName='c:/data/'+'room_type/'+x+'.csv'
    result.to_csv(fileName)

### df.loc[행번호], df.iloc[행번호, 열번호]

In [64]:
df=pd.read_csv('c:/data/AB_NYC_2019.csv')
df.head()
df.loc[3]

id                                                           3831
name                              Cozy Entire Floor of Brownstone
host_id                                                      4869
host_name                                             LisaRoxanne
neighbourhood_group                                      Brooklyn
neighbourhood                                        Clinton Hill
latitude                                                 40.68514
longitude                                               -73.95976
room_type                                         Entire home/apt
price                                                          89
minimum_nights                                                  1
number_of_reviews                                             270
last_review                                            2019-07-05
reviews_per_month                                            4.64
calculated_host_listings_count                                  1
availability_365                                              194
Name: 3, dtype: object

In [66]:
df.columns

Index(['id', 'name', 'host_id', 'host_name', 'neighbourhood_group',
       'neighbourhood', 'latitude', 'longitude', 'room_type', 'price',
       'minimum_nights', 'number_of_reviews', 'last_review',
       'reviews_per_month', 'calculated_host_listings_count',
       'availability_365'],
      dtype='object')

In [65]:
df.iloc[3,:]

id                                                           3831
name                              Cozy Entire Floor of Brownstone
host_id                                                      4869
host_name                                             LisaRoxanne
neighbourhood_group                                      Brooklyn
neighbourhood                                        Clinton Hill
latitude                                                 40.68514
longitude                                               -73.95976
room_type                                         Entire home/apt
price                                                          89
minimum_nights                                                  1
number_of_reviews                                             270
last_review                                            2019-07-05
reviews_per_month                                            4.64
calculated_host_listings_count                                  1
availability_365                                              194
Name: 3, dtype: object

In [68]:
df.iloc[:,1:3].head()  #1번열, 2번열, 3번열

                                               name  host_id
0                Clean & quiet apt home by the park     2787
1                             Skylit Midtown Castle     2845
2               THE VILLAGE OF HARLEM....NEW YORK !     4632
3                   Cozy Entire Floor of Brownstone     4869
4  Entire Apt: Spacious Studio/Loft by central park     7192

In [70]:
df.iloc[:,[1,3]].head() # 1번과 3번

                                               name    host_name
0                Clean & quiet apt home by the park         John
1                             Skylit Midtown Castle     Jennifer
2               THE VILLAGE OF HARLEM....NEW YORK !    Elisabeth
3                   Cozy Entire Floor of Brownstone  LisaRoxanne
4  Entire Apt: Spacious Studio/Loft by central park        Laura

In [71]:
df.loc[350]

id                                               94477
name                              The Vernon On Greene
host_id                                         478395
host_name                                        Jason
neighbourhood_group                           Brooklyn
neighbourhood                       Bedford-Stuyvesant
latitude                                      40.69305
longitude                                    -73.93185
room_type                              Entire home/apt
price                                              175
minimum_nights                                       2
number_of_reviews                                  370
last_review                                 2019-07-05
reviews_per_month                                 3.74
calculated_host_listings_count                       1
availability_365                                   204
Name: 350, dtype: object

In [75]:
df.set_index('host_name',inplace=True)  # host_name을 index화 시키기

In [81]:
# groupby

df.groupby('neighbourhood').count()

,id,name,host_id,neighbourhood_group,latitude,longitude,room_type,price,minimum_nights,number_of_reviews,last_review,reviews_per_month,calculated_host_listings_count,availability_365
neighbourhood,,,,,,,,,,,,,,
Allerton,42,42,42,42,42,42,42,42,42,42,37,37,42,42
Arden Heights,4,4,4,4,4,4,4,4,4,4,4,4,4,4
Arrochar,21,21,21,21,21,21,21,21,21,21,20,20,21,21
Arverne,77,77,77,77,77,77,77,77,77,77,66,66,77,77
Astoria,900,900,900,900,900,900,900,900,900,900,709,709,900,900
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
Windsor Terrace,157,157,157,157,157,157,157,157,157,157,128,128,157,157
Woodhaven,88,88,88,88,88,88,88,88,88,88,72,72,88,88
Woodlawn,11,11,11,11,11,11,11,11,11,11,11,11,11,11
Woodrow,1,1,1,1,1,1,1,1,1,1,0,0,1,1
Woodside,235,235,235,235,235,235,235,235,235,235,170,170,235,235

In [84]:
df[['neighbourhood','price', 'latitude']].groupby('neighbourhood').mean()
# 각 지역별 가격, 위경도를 보여줌

#df.iloc[:,[[5,9,7]]].groupby('neighbourhood').mean()

                      price   latitude
neighbourhood
Allerton          87.595238  40.865292
Arden Heights     67.250000  40.552410
Arrochar         115.000000  40.593900
Arverne          171.779221  40.591853
Astoria          117.187778  40.764299
...                     ...        ...
Windsor Terrace  138.993631  40.654612
Woodhaven         67.170455  40.691968
Woodlawn          60.090909  40.897421
Woodrow          700.000000  40.538840
Woodside          85.097872  40.745925

[221 rows x 2 columns]

In [76]:
df.head()

,id,name,host_id,neighbourhood_group,neighbourhood,latitude,longitude,room_type,price,minimum_nights,number_of_reviews,last_review,reviews_per_month,calculated_host_listings_count,availability_365
host_name,,,,,,,,,,,,,,,
John,2539,Clean & quiet apt home by the park,2787,Brooklyn,Kensington,40.64749,-73.97237,Private room,149,1,9,2018-10-19,0.21,6,365
Jennifer,2595,Skylit Midtown Castle,2845,Manhattan,Midtown,40.75362,-73.98377,Entire home/apt,225,1,45,2019-05-21,0.38,2,355
Elisabeth,3647,THE VILLAGE OF HARLEM....NEW YORK !,4632,Manhattan,Harlem,40.80902,-73.94190,Private room,150,3,0,NaN,NaN,1,365
LisaRoxanne,3831,Cozy Entire Floor of Brownstone,4869,Brooklyn,Clinton Hill,40.68514,-73.95976,Entire home/apt,89,1,270,2019-07-05,4.64,1,194
Laura,5022,Entire Apt: Spacious Studio/Loft by central park,7192,Manhattan,East Harlem,40.79851,-73.94399,Entire home/apt,80,10,9,2018-11-19,0.10,1,0

In [80]:
df[df.index=='John']

df.iloc[[3,5,7],:]  
# index가 꼭 번호일 필요는 없음

,id,name,host_id,neighbourhood_group,neighbourhood,latitude,longitude,room_type,price,minimum_nights,number_of_reviews,last_review,reviews_per_month,calculated_host_listings_count,availability_365
host_name,,,,,,,,,,,,,,,
LisaRoxanne,3831,Cozy Entire Floor of Brownstone,4869,Brooklyn,Clinton Hill,40.68514,-73.95976,Entire home/apt,89,1,270,2019-07-05,4.64,1,194
Chris,5099,Large Cozy 1 BR Apartment In Midtown East,7322,Manhattan,Murray Hill,40.74767,-73.97500,Entire home/apt,200,3,74,2019-06-22,0.59,1,129
Shunichi,5178,Large Furnished Room Near B'way,8967,Manhattan,Hell's Kitchen,40.76489,-73.98493,Private room,79,2,430,2019-06-24,3.47,1,220

In [89]:
#df[['neighbourhood', 'price', 'latitude']]

df[['neighbourhood','latitude','price']][df['neighbourhood']=='Astoria'].groupby('neighbourhood').mean()

#df[df['neighbourhood']=='Astoria']

                latitude       price
neighbourhood
Astoria        40.764299  117.187778

In [90]:
df[['neighbourhood','latitude','price']]\
                                        [(df['neighbourhood']=='Astoria') | (df['neighbourhood']=='Woodhaven')]\
                                        .groupby('neighbourhood').mean()

                latitude       price
neighbourhood
Astoria        40.764299  117.187778
Woodhaven      40.691968   67.170455

In [91]:
df[['neighbourhood','latitude','price']][df['neighbourhood']=='Astoria'].groupby('neighbourhood').mean()

                latitude       price
neighbourhood
Astoria        40.764299  117.187778

In [97]:
import matplotlib.pyplot as plt

neUnique=df['neighbourhood'].unique()

for x in neUnique:
    tmp=df[['neighbourhood','latitude','price']][df['neighbourhood']==x].groupby('neighbourhood').mean()
    print(x,'-'*10)
    display(tmp)
    # plt.bar(tmp.columns, tmp)
    # plt.title(tmp)
    # plt.show()

Kensington ----------

                latitude      price
neighbourhood
Kensington     40.641749  92.885714

Midtown ----------

                latitude       price
neighbourhood
Midtown        40.754871  282.719094

Harlem ----------

                latitude       price
neighbourhood
Harlem         40.816026  118.974041

Clinton Hill ----------

                latitude       price
neighbourhood
Clinton Hill   40.688114  181.893357

East Harlem ----------

                latitude       price
neighbourhood
East Harlem    40.796143  133.198747

Murray Hill ----------

                latitude       price
neighbourhood
Murray Hill    40.747435  220.958763

Bedford-Stuyvesant ----------

                     latitude       price
neighbourhood
Bedford-Stuyvesant  40.687199  107.678244

Hell's Kitchen ----------

                 latitude       price
neighbourhood
Hell's Kitchen  40.762157  204.794178

Upper West Side ----------

                  latitude       price
neighbourhood
Upper West Side  40.788463  210.918316

Chinatown ----------

               latitude       price
neighbourhood
Chinatown      40.71562  161.497283

South Slope ----------

                latitude       price
neighbourhood
South Slope    40.664926  146.725352

West Village ----------

                latitude       price
neighbourhood
West Village   40.734351  267.682292

Williamsburg ----------

                latitude       price
neighbourhood
Williamsburg   40.712563  143.802806

Fort Greene ----------

                latitude       price
neighbourhood
Fort Greene    40.690188  151.374233

Chelsea ----------

                latitude       price
neighbourhood
Chelsea        40.744687  249.738544

Crown Heights ----------

                latitude       price
neighbourhood
Crown Heights  40.672699  112.480179

Park Slope ----------

                latitude       price
neighbourhood
Park Slope     40.674168  176.312253

Windsor Terrace ----------

                  latitude       price
neighbourhood
Windsor Terrace  40.654612  138.993631

Inwood ----------

                latitude      price
neighbourhood
Inwood         40.865316  88.896825

East Village ----------

                latitude       price
neighbourhood
East Village   40.726763  186.083108

Greenpoint ----------

                latitude       price
neighbourhood
Greenpoint     40.727967  144.822422

Bushwick ----------

                latitude      price
neighbourhood
Bushwick       40.696741  84.800406

Flatbush ----------

                latitude     price
neighbourhood
Flatbush       40.644954  92.21256

Lower East Side ----------

                  latitude       price
neighbourhood
Lower East Side  40.718387  186.312843

Prospect-Lefferts Gardens ----------

                            latitude       price
neighbourhood
Prospect-Lefferts Gardens  40.659285  110.401869

Long Island City ----------

                   latitude       price
neighbourhood
Long Island City  40.752452  127.465549

Kips Bay ----------

                latitude       price
neighbourhood
Kips Bay       40.741815  202.408511

SoHo ----------

               latitude       price
neighbourhood
SoHo           40.72438  287.103352

Upper East Side ----------

                  latitude       price
neighbourhood
Upper East Side  40.772748  188.948276

Prospect Heights ----------

                   latitude       price
neighbourhood
Prospect Heights  40.677532  173.372549

Washington Heights ----------

                     latitude      price
neighbourhood
Washington Heights  40.844495  89.610679

Woodside ----------

                latitude      price
neighbourhood
Woodside       40.745925  85.097872

Brooklyn Heights ----------

                   latitude       price
neighbourhood
Brooklyn Heights  40.694793  209.064935

Carroll Gardens ----------

                  latitude       price
neighbourhood
Carroll Gardens  40.680635  175.914163

Gowanus ----------

                latitude       price
neighbourhood
Gowanus        40.676299  158.801619

Flatlands ----------

                latitude       price
neighbourhood
Flatlands      40.625543  126.433735

Cobble Hill ----------

                latitude       price
neighbourhood
Cobble Hill    40.687267  211.929293

Flushing ----------

                latitude      price
neighbourhood
Flushing       40.754884  93.514085

Boerum Hill ----------

                latitude       price
neighbourhood
Boerum Hill    40.686391  176.135593

Sunnyside ----------

                latitude      price
neighbourhood
Sunnyside      40.742414  84.865014

DUMBO ----------

                latitude       price
neighbourhood
DUMBO          40.703266  196.305556

St. George ----------

                latitude       price
neighbourhood
St. George     40.643308  118.145833

Highbridge ----------

               latitude      price
neighbourhood
Highbridge     40.83549  71.111111

Financial District ----------

                     latitude       price
neighbourhood
Financial District  40.706906  225.490591

Ridgewood ----------

                latitude      price
neighbourhood
Ridgewood      40.704078  77.184397

Morningside Heights ----------

                      latitude       price
neighbourhood
Morningside Heights  40.808342  114.783237

Jamaica ----------

                latitude      price
neighbourhood
Jamaica        40.685046  95.770563

Middle Village ----------

                 latitude       price
neighbourhood
Middle Village  40.716306  109.580645

NoHo ----------

               latitude       price
neighbourhood
NoHo           40.72701  295.717949

Ditmars Steinway ----------

                  latitude      price
neighbourhood
Ditmars Steinway  40.77503  95.029126

Flatiron District ----------

                    latitude    price
neighbourhood
Flatiron District  40.741052  341.925

Roosevelt Island ----------

                   latitude      price
neighbourhood
Roosevelt Island  40.763283  113.25974

Greenwich Village ----------

                    latitude       price
neighbourhood
Greenwich Village  40.730663  263.405612

Little Italy ----------

               latitude       price
neighbourhood
Little Italy    40.7188  222.066116

East Flatbush ----------

               latitude    price
neighbourhood
East Flatbush    40.649  104.222

Tompkinsville ----------

                latitude      price
neighbourhood
Tompkinsville  40.633135  76.190476

Astoria ----------

                latitude       price
neighbourhood
Astoria        40.764299  117.187778

Clason Point ----------

               latitude       price
neighbourhood
Clason Point   40.81175  112.761905

Eastchester ----------

                latitude       price
neighbourhood
Eastchester    40.880852  141.692308

Kingsbridge ----------

                latitude      price
neighbourhood
Kingsbridge    40.876798  77.928571

Two Bridges ----------

                latitude       price
neighbourhood
Two Bridges    40.711727  127.069444

Queens Village ----------

                 latitude      price
neighbourhood
Queens Village  40.714594  83.933333

Rockaway Beach ----------

                 latitude       price
neighbourhood
Rockaway Beach  40.587434  132.178571

Forest Hills ----------

                latitude    price
neighbourhood
Forest Hills   40.721643  121.625

Nolita ----------

                latitude      price
neighbourhood
Nolita         40.722146  230.13834

Woodlawn ----------

                latitude      price
neighbourhood
Woodlawn       40.897421  60.090909

University Heights ----------

                     latitude      price
neighbourhood
University Heights  40.858058  69.571429

Gravesend ----------

                latitude      price
neighbourhood
Gravesend      40.595598  79.014706

Gramercy ----------

                latitude       price
neighbourhood
Gramercy       40.735572  222.754438

Allerton ----------

                latitude      price
neighbourhood
Allerton       40.865292  87.595238

East New York ----------

                latitude      price
neighbourhood
East New York  40.668212  85.426606

Theater District ----------

                   latitude       price
neighbourhood
Theater District  40.759837  248.013889

Concourse Village ----------

                    latitude     price
neighbourhood
Concourse Village  40.830054  73.78125

Sheepshead Bay ----------

                latitude      price
neighbourhood
Sheepshead Bay  40.59623  105.77439

Emerson Hill ----------

                latitude  price
neighbourhood
Emerson Hill   40.607162   68.2

Fort Hamilton ----------

                latitude      price
neighbourhood
Fort Hamilton  40.618958  93.818182

Bensonhurst ----------

                latitude      price
neighbourhood
Bensonhurst    40.612183  75.786667

Tribeca ----------

                latitude       price
neighbourhood
Tribeca        40.717744  490.638418

Shore Acres ----------

                latitude       price
neighbourhood
Shore Acres    40.608823  152.714286

Sunset Park ----------

                latitude       price
neighbourhood
Sunset Park    40.652525  113.041026

Concourse ----------

                latitude  price
neighbourhood
Concourse      40.826919  86.18

Elmhurst ----------

                latitude      price
neighbourhood
Elmhurst       40.739936  80.459916

Brighton Beach ----------

                 latitude       price
neighbourhood
Brighton Beach  40.578413  131.933333

Jackson Heights ----------

                  latitude      price
neighbourhood
Jackson Heights  40.751743  80.897849

Cypress Hills ----------

                latitude       price
neighbourhood
Cypress Hills  40.682195  128.903704

St. Albans ----------

                latitude       price
neighbourhood
St. Albans     40.695668  100.828947

Arrochar ----------

               latitude  price
neighbourhood
Arrochar        40.5939  115.0

Rego Park ----------

                latitude      price
neighbourhood
Rego Park      40.726805  83.877358

Wakefield ----------

                latitude  price
neighbourhood
Wakefield      40.893178  85.58

Clifton ----------

                latitude      price
neighbourhood
Clifton        40.619166  84.933333

Bay Ridge ----------

                latitude       price
neighbourhood
Bay Ridge      40.631424  144.432624

Graniteville ----------

               latitude      price
neighbourhood
Graniteville   40.62283  68.666667

Spuyten Duyvil ----------

                latitude   price
neighbourhood
Spuyten Duyvil  40.88109  154.75

Stapleton ----------

                latitude      price
neighbourhood
Stapleton      40.632663  98.962963

Briarwood ----------

                latitude    price
neighbourhood
Briarwood      40.709755  105.875

Ozone Park ----------

                latitude      price
neighbourhood
Ozone Park     40.681239  85.274194

Columbia St ----------

                latitude       price
neighbourhood
Columbia St    40.685023  162.952381

Vinegar Hill ----------

                latitude       price
neighbourhood
Vinegar Hill   40.701547  187.176471

Mott Haven ----------

                latitude      price
neighbourhood
Mott Haven     40.810997  88.916667

Longwood ----------

                latitude      price
neighbourhood
Longwood       40.821278  91.919355

Canarsie ----------

                latitude       price
neighbourhood
Canarsie       40.638594  104.367347

Battery Park City ----------

                    latitude       price
neighbourhood
Battery Park City  40.709964  367.557143

Civic Center ----------

                latitude       price
neighbourhood
Civic Center   40.713855  191.942308

East Elmhurst ----------

                latitude      price
neighbourhood
East Elmhurst  40.762784  81.183784

New Springville ----------

                  latitude  price
neighbourhood
New Springville  40.584513   76.0

Morris Heights ----------

                 latitude      price
neighbourhood
Morris Heights  40.849131  76.941176

Arverne ----------

                latitude       price
neighbourhood
Arverne        40.591853  171.779221

Cambria Heights ----------

                  latitude      price
neighbourhood
Cambria Heights  40.693782  81.730769

Tottenville ----------

               latitude       price
neighbourhood
Tottenville    40.50735  144.857143

Mariners Harbor ----------

                  latitude   price
neighbourhood
Mariners Harbor  40.633179  94.625

Concord ----------

                latitude      price
neighbourhood
Concord        40.602012  58.192308

Borough Park ----------

                latitude      price
neighbourhood
Borough Park   40.637273  63.066176

Bayside ----------

                latitude       price
neighbourhood
Bayside        40.759776  157.948718

Downtown Brooklyn ----------

                    latitude       price
neighbourhood
Downtown Brooklyn  40.694322  150.349398

Port Morris ----------

                latitude      price
neighbourhood
Port Morris    40.806734  79.891304

Fieldston ----------

                latitude      price
neighbourhood
Fieldston      40.891942  75.083333

Kew Gardens ----------

                latitude   price
neighbourhood
Kew Gardens    40.708302  88.375

Midwood ----------

                latitude     price
neighbourhood
Midwood        40.620207  80.33945

College Point ----------

                latitude  price
neighbourhood
College Point  40.784803   88.0

Mount Eden ----------

                latitude  price
neighbourhood
Mount Eden     40.842063   58.5

City Island ----------

                latitude  price
neighbourhood
City Island    40.847872  173.0

Glendale ----------

                latitude      price
neighbourhood
Glendale       40.700784  90.796296

Port Richmond ----------

                latitude      price
neighbourhood
Port Richmond  40.633149  90.111111

Red Hook ----------

               latitude       price
neighbourhood
Red Hook       40.67721  143.455696

Richmond Hill ----------

                latitude      price
neighbourhood
Richmond Hill  40.693985  87.117021

Bellerose ----------

                latitude      price
neighbourhood
Bellerose      40.731111  99.357143

Maspeth ----------

                latitude      price
neighbourhood
Maspeth        40.729699  83.645455

Williamsbridge ----------

                 latitude  price
neighbourhood
Williamsbridge  40.878935  96.75

Soundview ----------

                latitude      price
neighbourhood
Soundview      40.826921  53.466667

Woodhaven ----------

                latitude      price
neighbourhood
Woodhaven      40.691968  67.170455

Woodrow ----------

               latitude  price
neighbourhood
Woodrow        40.53884  700.0

Co-op City ----------

                latitude  price
neighbourhood
Co-op City     40.864815   77.5

Stuyvesant Town ----------

                  latitude       price
neighbourhood
Stuyvesant Town  40.731839  169.108108

Parkchester ----------

               latitude      price
neighbourhood
Parkchester    40.83565  69.076923

North Riverdale ----------

                  latitude  price
neighbourhood
North Riverdale  40.907599   79.9

Dyker Heights ----------

                latitude      price
neighbourhood
Dyker Heights  40.624088  93.416667

Bronxdale ----------

                latitude      price
neighbourhood
Bronxdale      40.854731  57.105263

Sea Gate ----------

                latitude       price
neighbourhood
Sea Gate       40.577119  487.857143

Riverdale ----------

                latitude       price
neighbourhood
Riverdale      40.887352  442.090909

Kew Gardens Hills ----------

                   latitude       price
neighbourhood
Kew Gardens Hills  40.72443  112.307692

Bay Terrace ----------

                latitude  price
neighbourhood
Bay Terrace    40.780663  142.0

Norwood ----------

                latitude      price
neighbourhood
Norwood        40.875036  75.548387

Claremont Village ----------

                    latitude      price
neighbourhood
Claremont Village  40.839185  87.464286

Whitestone ----------

                latitude       price
neighbourhood
Whitestone     40.784238  107.545455

Fordham ----------

                latitude      price
neighbourhood
Fordham        40.863222  69.444444

Bayswater ----------

                latitude      price
neighbourhood
Bayswater      40.605718  87.470588

Navy Yard ----------

                latitude       price
neighbourhood
Navy Yard      40.699821  151.642857

Brownsville ----------

                latitude      price
neighbourhood
Brownsville    40.664674  76.459016

Eltingville ----------

                latitude       price
neighbourhood
Eltingville    40.541043  141.666667

Fresh Meadows ----------

                latitude  price
neighbourhood
Fresh Meadows  40.739073   99.5

Mount Hope ----------

               latitude  price
neighbourhood
Mount Hope     40.84843   77.5

Lighthouse Hill ----------

                  latitude  price
neighbourhood
Lighthouse Hill  40.576795  157.5

Springfield Gardens ----------

                     latitude      price
neighbourhood
Springfield Gardens  40.66769  94.235294

Howard Beach ----------

                latitude  price
neighbourhood
Howard Beach   40.661451  115.4

Belle Harbor ----------

                latitude  price
neighbourhood
Belle Harbor   40.576151  171.5

Jamaica Estates ----------

                  latitude       price
neighbourhood
Jamaica Estates  40.718346  182.947368

Van Nest ----------

               latitude       price
neighbourhood
Van Nest       40.84326  113.818182

Morris Park ----------

                latitude      price
neighbourhood
Morris Park    40.852279  69.333333

West Brighton ----------

                latitude      price
neighbourhood
West Brighton  40.631932  80.555556

Far Rockaway ----------

                latitude       price
neighbourhood
Far Rockaway   40.597409  165.862069

South Ozone Park ----------

                   latitude  price
neighbourhood
South Ozone Park  40.672259   82.4

Tremont ----------

                latitude      price
neighbourhood
Tremont        40.843679  51.545455

Corona ----------

                latitude      price
neighbourhood
Corona         40.742901  59.171875

Great Kills ----------

                latitude  price
neighbourhood
Great Kills    40.549969  100.6

Manhattan Beach ----------

                  latitude  price
neighbourhood
Manhattan Beach  40.579365  103.5

Marble Hill ----------

                latitude      price
neighbourhood
Marble Hill    40.875741  89.166667

Dongan Hills ----------

                latitude      price
neighbourhood
Dongan Hills   40.580396  79.428571

Castleton Corners ----------

                    latitude   price
neighbourhood
Castleton Corners  40.617103  139.75

East Morrisania ----------

                  latitude  price
neighbourhood
East Morrisania  40.831259   85.0

Hunts Point ----------

                latitude  price
neighbourhood
Hunts Point    40.815522   50.5

Neponsit ----------

               latitude       price
neighbourhood
Neponsit       40.57063  274.666667

Pelham Bay ----------

               latitude  price
neighbourhood
Pelham Bay     40.84935  105.0

Randall Manor ----------

                latitude  price
neighbourhood
Randall Manor  40.632749  336.0

Throgs Neck ----------

                latitude      price
neighbourhood
Throgs Neck    40.824156  91.041667

Todt Hill ----------

                latitude  price
neighbourhood
Todt Hill      40.603375  169.0

West Farms ----------

               latitude  price
neighbourhood
West Farms     40.84135  122.0

Silver Lake ----------

                latitude  price
neighbourhood
Silver Lake    40.623395   70.0

Morrisania ----------

                latitude      price
neighbourhood
Morrisania     40.828281  83.444444

Laurelton ----------

                latitude      price
neighbourhood
Laurelton      40.675293  95.333333

Grymes Hill ----------

                latitude       price
neighbourhood
Grymes Hill    40.614849  159.142857

Holliswood ----------

                latitude   price
neighbourhood
Holliswood     40.722453  135.75

Pelham Gardens ----------

                 latitude      price
neighbourhood
Pelham Gardens  40.863684  93.607143

Belmont ----------

                latitude   price
neighbourhood
Belmont        40.855062  77.125

Rosedale ----------

                latitude      price
neighbourhood
Rosedale       40.659469  76.694915

Edgemere ----------

                latitude      price
neighbourhood
Edgemere       40.594675  94.727273

New Brighton ----------

                latitude  price
neighbourhood
New Brighton   40.642608  101.8

Midland Beach ----------

                latitude      price
neighbourhood
Midland Beach  40.573697  91.833333

Baychester ----------

                latitude      price
neighbourhood
Baychester     40.873616  75.428571

Melrose ----------

                latitude  price
neighbourhood
Melrose        40.821535   83.3

Bergen Beach ----------

                latitude  price
neighbourhood
Bergen Beach   40.623371  106.7

Richmondtown ----------

               latitude  price
neighbourhood
Richmondtown   40.57093   78.0

Howland Hook ----------

                latitude  price
neighbourhood
Howland Hook   40.631295  100.0

Schuylerville ----------

                latitude      price
neighbourhood
Schuylerville  40.835858  69.230769

Coney Island ----------

                latitude       price
neighbourhood
Coney Island   40.575939  123.705882

New Dorp Beach ----------

                 latitude  price
neighbourhood
New Dorp Beach  40.564828   57.4

Prince's Bay ----------

               latitude  price
neighbourhood
Prince's Bay    40.5257  409.5

South Beach ----------

                latitude  price
neighbourhood
South Beach    40.591201  89.25

Bath Beach ----------

                latitude      price
neighbourhood
Bath Beach     40.604134  81.764706

Jamaica Hills ----------

                latitude    price
neighbourhood
Jamaica Hills  40.713589  132.125

Oakwood ----------

                latitude  price
neighbourhood
Oakwood        40.560512   81.2

Castle Hill ----------

                latitude  price
neighbourhood
Castle Hill    40.816889   63.0

Hollis ----------

               latitude      price
neighbourhood
Hollis         40.71452  88.642857

Douglaston ----------

                latitude  price
neighbourhood
Douglaston     40.759641  82.75

Huguenot ----------

                latitude       price
neighbourhood
Huguenot       40.539467  118.333333

Olinville ----------

                latitude  price
neighbourhood
Olinville      40.883655   64.0

Edenwald ----------

                latitude  price
neighbourhood
Edenwald       40.888035   82.0

Grant City ----------

               latitude      price
neighbourhood
Grant City     40.57893  57.666667

Westerleigh ----------

                latitude  price
neighbourhood
Westerleigh    40.613895   71.5

Bay Terrace, Staten Island ----------

                             latitude  price
neighbourhood
Bay Terrace, Staten Island  40.551435  102.5

Westchester Square ----------

                    latitude  price
neighbourhood
Westchester Square  40.83969  122.2

Little Neck ----------

                latitude  price
neighbourhood
Little Neck    40.764698   75.2

Fort Wadsworth ----------

                latitude  price
neighbourhood
Fort Wadsworth  40.59546  800.0

Rosebank ----------

                latitude       price
neighbourhood
Rosebank       40.612149  111.857143

Unionport ----------

                latitude       price
neighbourhood
Unionport      40.828294  137.142857

Mill Basin ----------

                latitude   price
neighbourhood
Mill Basin     40.612382  179.75

Arden Heights ----------

               latitude  price
neighbourhood
Arden Heights  40.55241  67.25

Bull's Head ----------

               latitude      price
neighbourhood
Bull's Head    40.60115  47.333333

New Dorp ----------

               latitude  price
neighbourhood
New Dorp       40.57044   57.0

Rossville ----------

               latitude  price
neighbourhood
Rossville       40.5479   75.0

Breezy Point ----------

               latitude       price
neighbourhood
Breezy Point   40.56573  213.333333

Willowbrook ----------

               latitude  price
neighbourhood
Willowbrook    40.59886  249.0

In [101]:
filed='room_type'
neUnique=df[filed].unique()

for x in neUnique:
    tmp=df[[filed,'latitude','price']][df[filed]==x].groupby(filed).mean()
    print(x,'-'*10)
    display(tmp)

Private room ----------

               latitude      price
room_type
Private room  40.729208  89.780973

Entire home/apt ----------

                  latitude       price
room_type
Entire home/apt  40.728649  211.794246

Shared room ----------

              latitude      price
room_type
Shared room  40.730514  70.127586

In [103]:
filedlist=['room_type', 'neighbourhood']

for filed in filedlist:
    print(filed, '--> data')
    neUnique=df[filed].unique()
    
    for x in neUnique:        
        tmp=df[[filed,'latitude','price']][df[filed]==x].groupby(filed).mean()
        print(x,'-'*10)
        display(tmp)

room_type --> data
Private room ----------

               latitude      price
room_type
Private room  40.729208  89.780973

Entire home/apt ----------

                  latitude       price
room_type
Entire home/apt  40.728649  211.794246

Shared room ----------

              latitude      price
room_type
Shared room  40.730514  70.127586

neighbourhood --> data
Kensington ----------

                latitude      price
neighbourhood
Kensington     40.641749  92.885714

Midtown ----------

                latitude       price
neighbourhood
Midtown        40.754871  282.719094

Harlem ----------

                latitude       price
neighbourhood
Harlem         40.816026  118.974041

Clinton Hill ----------

                latitude       price
neighbourhood
Clinton Hill   40.688114  181.893357

East Harlem ----------

                latitude       price
neighbourhood
East Harlem    40.796143  133.198747

Murray Hill ----------

                latitude       price
neighbourhood
Murray Hill    40.747435  220.958763

Bedford-Stuyvesant ----------

                     latitude       price
neighbourhood
Bedford-Stuyvesant  40.687199  107.678244

Hell's Kitchen ----------

                 latitude       price
neighbourhood
Hell's Kitchen  40.762157  204.794178

Upper West Side ----------

                  latitude       price
neighbourhood
Upper West Side  40.788463  210.918316

Chinatown ----------

               latitude       price
neighbourhood
Chinatown      40.71562  161.497283

South Slope ----------

                latitude       price
neighbourhood
South Slope    40.664926  146.725352

West Village ----------

                latitude       price
neighbourhood
West Village   40.734351  267.682292

Williamsburg ----------

                latitude       price
neighbourhood
Williamsburg   40.712563  143.802806

Fort Greene ----------

                latitude       price
neighbourhood
Fort Greene    40.690188  151.374233

Chelsea ----------

                latitude       price
neighbourhood
Chelsea        40.744687  249.738544

Crown Heights ----------

                latitude       price
neighbourhood
Crown Heights  40.672699  112.480179

Park Slope ----------

                latitude       price
neighbourhood
Park Slope     40.674168  176.312253

Windsor Terrace ----------

                  latitude       price
neighbourhood
Windsor Terrace  40.654612  138.993631

Inwood ----------

                latitude      price
neighbourhood
Inwood         40.865316  88.896825

East Village ----------

                latitude       price
neighbourhood
East Village   40.726763  186.083108

Greenpoint ----------

                latitude       price
neighbourhood
Greenpoint     40.727967  144.822422

Bushwick ----------

                latitude      price
neighbourhood
Bushwick       40.696741  84.800406

Flatbush ----------

                latitude     price
neighbourhood
Flatbush       40.644954  92.21256

Lower East Side ----------

                  latitude       price
neighbourhood
Lower East Side  40.718387  186.312843

Prospect-Lefferts Gardens ----------

                            latitude       price
neighbourhood
Prospect-Lefferts Gardens  40.659285  110.401869

Long Island City ----------

                   latitude       price
neighbourhood
Long Island City  40.752452  127.465549

Kips Bay ----------

                latitude       price
neighbourhood
Kips Bay       40.741815  202.408511

SoHo ----------

               latitude       price
neighbourhood
SoHo           40.72438  287.103352

Upper East Side ----------

                  latitude       price
neighbourhood
Upper East Side  40.772748  188.948276

Prospect Heights ----------

                   latitude       price
neighbourhood
Prospect Heights  40.677532  173.372549

Washington Heights ----------

                     latitude      price
neighbourhood
Washington Heights  40.844495  89.610679

Woodside ----------

                latitude      price
neighbourhood
Woodside       40.745925  85.097872

Brooklyn Heights ----------

                   latitude       price
neighbourhood
Brooklyn Heights  40.694793  209.064935

Carroll Gardens ----------

                  latitude       price
neighbourhood
Carroll Gardens  40.680635  175.914163

Gowanus ----------

                latitude       price
neighbourhood
Gowanus        40.676299  158.801619

Flatlands ----------

                latitude       price
neighbourhood
Flatlands      40.625543  126.433735

Cobble Hill ----------

                latitude       price
neighbourhood
Cobble Hill    40.687267  211.929293

Flushing ----------

                latitude      price
neighbourhood
Flushing       40.754884  93.514085

Boerum Hill ----------

                latitude       price
neighbourhood
Boerum Hill    40.686391  176.135593

Sunnyside ----------

                latitude      price
neighbourhood
Sunnyside      40.742414  84.865014

DUMBO ----------

                latitude       price
neighbourhood
DUMBO          40.703266  196.305556

St. George ----------

                latitude       price
neighbourhood
St. George     40.643308  118.145833

Highbridge ----------

               latitude      price
neighbourhood
Highbridge     40.83549  71.111111

Financial District ----------

                     latitude       price
neighbourhood
Financial District  40.706906  225.490591

Ridgewood ----------

                latitude      price
neighbourhood
Ridgewood      40.704078  77.184397

Morningside Heights ----------

                      latitude       price
neighbourhood
Morningside Heights  40.808342  114.783237

Jamaica ----------

                latitude      price
neighbourhood
Jamaica        40.685046  95.770563

Middle Village ----------

                 latitude       price
neighbourhood
Middle Village  40.716306  109.580645

NoHo ----------

               latitude       price
neighbourhood
NoHo           40.72701  295.717949

Ditmars Steinway ----------

                  latitude      price
neighbourhood
Ditmars Steinway  40.77503  95.029126

Flatiron District ----------

                    latitude    price
neighbourhood
Flatiron District  40.741052  341.925

Roosevelt Island ----------

                   latitude      price
neighbourhood
Roosevelt Island  40.763283  113.25974

Greenwich Village ----------

                    latitude       price
neighbourhood
Greenwich Village  40.730663  263.405612

Little Italy ----------

               latitude       price
neighbourhood
Little Italy    40.7188  222.066116

East Flatbush ----------

               latitude    price
neighbourhood
East Flatbush    40.649  104.222

Tompkinsville ----------

                latitude      price
neighbourhood
Tompkinsville  40.633135  76.190476

Astoria ----------

                latitude       price
neighbourhood
Astoria        40.764299  117.187778

Clason Point ----------

               latitude       price
neighbourhood
Clason Point   40.81175  112.761905

Eastchester ----------

                latitude       price
neighbourhood
Eastchester    40.880852  141.692308

Kingsbridge ----------

                latitude      price
neighbourhood
Kingsbridge    40.876798  77.928571

Two Bridges ----------

                latitude       price
neighbourhood
Two Bridges    40.711727  127.069444

Queens Village ----------

                 latitude      price
neighbourhood
Queens Village  40.714594  83.933333

Rockaway Beach ----------

                 latitude       price
neighbourhood
Rockaway Beach  40.587434  132.178571

Forest Hills ----------

                latitude    price
neighbourhood
Forest Hills   40.721643  121.625

Nolita ----------

                latitude      price
neighbourhood
Nolita         40.722146  230.13834

Woodlawn ----------

                latitude      price
neighbourhood
Woodlawn       40.897421  60.090909

University Heights ----------

                     latitude      price
neighbourhood
University Heights  40.858058  69.571429

Gravesend ----------

                latitude      price
neighbourhood
Gravesend      40.595598  79.014706

Gramercy ----------

                latitude       price
neighbourhood
Gramercy       40.735572  222.754438

Allerton ----------

                latitude      price
neighbourhood
Allerton       40.865292  87.595238

East New York ----------

                latitude      price
neighbourhood
East New York  40.668212  85.426606

Theater District ----------

                   latitude       price
neighbourhood
Theater District  40.759837  248.013889

Concourse Village ----------

                    latitude     price
neighbourhood
Concourse Village  40.830054  73.78125

Sheepshead Bay ----------

                latitude      price
neighbourhood
Sheepshead Bay  40.59623  105.77439

Emerson Hill ----------

                latitude  price
neighbourhood
Emerson Hill   40.607162   68.2

Fort Hamilton ----------

                latitude      price
neighbourhood
Fort Hamilton  40.618958  93.818182

Bensonhurst ----------

                latitude      price
neighbourhood
Bensonhurst    40.612183  75.786667

Tribeca ----------

                latitude       price
neighbourhood
Tribeca        40.717744  490.638418

Shore Acres ----------

                latitude       price
neighbourhood
Shore Acres    40.608823  152.714286

Sunset Park ----------

                latitude       price
neighbourhood
Sunset Park    40.652525  113.041026

Concourse ----------

                latitude  price
neighbourhood
Concourse      40.826919  86.18

Elmhurst ----------

                latitude      price
neighbourhood
Elmhurst       40.739936  80.459916

Brighton Beach ----------

                 latitude       price
neighbourhood
Brighton Beach  40.578413  131.933333

Jackson Heights ----------

                  latitude      price
neighbourhood
Jackson Heights  40.751743  80.897849

Cypress Hills ----------

                latitude       price
neighbourhood
Cypress Hills  40.682195  128.903704

St. Albans ----------

                latitude       price
neighbourhood
St. Albans     40.695668  100.828947

Arrochar ----------

               latitude  price
neighbourhood
Arrochar        40.5939  115.0

Rego Park ----------

                latitude      price
neighbourhood
Rego Park      40.726805  83.877358

Wakefield ----------

                latitude  price
neighbourhood
Wakefield      40.893178  85.58

Clifton ----------

                latitude      price
neighbourhood
Clifton        40.619166  84.933333

Bay Ridge ----------

                latitude       price
neighbourhood
Bay Ridge      40.631424  144.432624

Graniteville ----------

               latitude      price
neighbourhood
Graniteville   40.62283  68.666667

Spuyten Duyvil ----------

                latitude   price
neighbourhood
Spuyten Duyvil  40.88109  154.75

Stapleton ----------

                latitude      price
neighbourhood
Stapleton      40.632663  98.962963

Briarwood ----------

                latitude    price
neighbourhood
Briarwood      40.709755  105.875

Ozone Park ----------

                latitude      price
neighbourhood
Ozone Park     40.681239  85.274194

Columbia St ----------

                latitude       price
neighbourhood
Columbia St    40.685023  162.952381

Vinegar Hill ----------

                latitude       price
neighbourhood
Vinegar Hill   40.701547  187.176471

Mott Haven ----------

                latitude      price
neighbourhood
Mott Haven     40.810997  88.916667

Longwood ----------

                latitude      price
neighbourhood
Longwood       40.821278  91.919355

Canarsie ----------

                latitude       price
neighbourhood
Canarsie       40.638594  104.367347

Battery Park City ----------

                    latitude       price
neighbourhood
Battery Park City  40.709964  367.557143

Civic Center ----------

                latitude       price
neighbourhood
Civic Center   40.713855  191.942308

East Elmhurst ----------

                latitude      price
neighbourhood
East Elmhurst  40.762784  81.183784

New Springville ----------

                  latitude  price
neighbourhood
New Springville  40.584513   76.0

Morris Heights ----------

                 latitude      price
neighbourhood
Morris Heights  40.849131  76.941176

Arverne ----------

                latitude       price
neighbourhood
Arverne        40.591853  171.779221

Cambria Heights ----------

                  latitude      price
neighbourhood
Cambria Heights  40.693782  81.730769

Tottenville ----------

               latitude       price
neighbourhood
Tottenville    40.50735  144.857143

Mariners Harbor ----------

                  latitude   price
neighbourhood
Mariners Harbor  40.633179  94.625

Concord ----------

                latitude      price
neighbourhood
Concord        40.602012  58.192308

Borough Park ----------

                latitude      price
neighbourhood
Borough Park   40.637273  63.066176

Bayside ----------

                latitude       price
neighbourhood
Bayside        40.759776  157.948718

Downtown Brooklyn ----------

                    latitude       price
neighbourhood
Downtown Brooklyn  40.694322  150.349398

Port Morris ----------

                latitude      price
neighbourhood
Port Morris    40.806734  79.891304

Fieldston ----------

                latitude      price
neighbourhood
Fieldston      40.891942  75.083333

Kew Gardens ----------

                latitude   price
neighbourhood
Kew Gardens    40.708302  88.375

Midwood ----------

                latitude     price
neighbourhood
Midwood        40.620207  80.33945

College Point ----------

                latitude  price
neighbourhood
College Point  40.784803   88.0

Mount Eden ----------

                latitude  price
neighbourhood
Mount Eden     40.842063   58.5

City Island ----------

                latitude  price
neighbourhood
City Island    40.847872  173.0

Glendale ----------

                latitude      price
neighbourhood
Glendale       40.700784  90.796296

Port Richmond ----------

                latitude      price
neighbourhood
Port Richmond  40.633149  90.111111

Red Hook ----------

               latitude       price
neighbourhood
Red Hook       40.67721  143.455696

Richmond Hill ----------

                latitude      price
neighbourhood
Richmond Hill  40.693985  87.117021

Bellerose ----------

                latitude      price
neighbourhood
Bellerose      40.731111  99.357143

Maspeth ----------

                latitude      price
neighbourhood
Maspeth        40.729699  83.645455

Williamsbridge ----------

                 latitude  price
neighbourhood
Williamsbridge  40.878935  96.75

Soundview ----------

                latitude      price
neighbourhood
Soundview      40.826921  53.466667

Woodhaven ----------

                latitude      price
neighbourhood
Woodhaven      40.691968  67.170455

Woodrow ----------

               latitude  price
neighbourhood
Woodrow        40.53884  700.0

Co-op City ----------

                latitude  price
neighbourhood
Co-op City     40.864815   77.5

Stuyvesant Town ----------

                  latitude       price
neighbourhood
Stuyvesant Town  40.731839  169.108108

Parkchester ----------

               latitude      price
neighbourhood
Parkchester    40.83565  69.076923

North Riverdale ----------

                  latitude  price
neighbourhood
North Riverdale  40.907599   79.9

Dyker Heights ----------

                latitude      price
neighbourhood
Dyker Heights  40.624088  93.416667

Bronxdale ----------

                latitude      price
neighbourhood
Bronxdale      40.854731  57.105263

Sea Gate ----------

                latitude       price
neighbourhood
Sea Gate       40.577119  487.857143

Riverdale ----------

                latitude       price
neighbourhood
Riverdale      40.887352  442.090909

Kew Gardens Hills ----------

                   latitude       price
neighbourhood
Kew Gardens Hills  40.72443  112.307692

Bay Terrace ----------

                latitude  price
neighbourhood
Bay Terrace    40.780663  142.0

Norwood ----------

                latitude      price
neighbourhood
Norwood        40.875036  75.548387

Claremont Village ----------

                    latitude      price
neighbourhood
Claremont Village  40.839185  87.464286

Whitestone ----------

                latitude       price
neighbourhood
Whitestone     40.784238  107.545455

Fordham ----------

                latitude      price
neighbourhood
Fordham        40.863222  69.444444

Bayswater ----------

                latitude      price
neighbourhood
Bayswater      40.605718  87.470588

Navy Yard ----------

                latitude       price
neighbourhood
Navy Yard      40.699821  151.642857

Brownsville ----------

                latitude      price
neighbourhood
Brownsville    40.664674  76.459016

Eltingville ----------

                latitude       price
neighbourhood
Eltingville    40.541043  141.666667

Fresh Meadows ----------

                latitude  price
neighbourhood
Fresh Meadows  40.739073   99.5

Mount Hope ----------

               latitude  price
neighbourhood
Mount Hope     40.84843   77.5

Lighthouse Hill ----------

                  latitude  price
neighbourhood
Lighthouse Hill  40.576795  157.5

Springfield Gardens ----------

                     latitude      price
neighbourhood
Springfield Gardens  40.66769  94.235294

Howard Beach ----------

                latitude  price
neighbourhood
Howard Beach   40.661451  115.4

Belle Harbor ----------

                latitude  price
neighbourhood
Belle Harbor   40.576151  171.5

Jamaica Estates ----------

                  latitude       price
neighbourhood
Jamaica Estates  40.718346  182.947368

Van Nest ----------

               latitude       price
neighbourhood
Van Nest       40.84326  113.818182

Morris Park ----------

                latitude      price
neighbourhood
Morris Park    40.852279  69.333333

West Brighton ----------

                latitude      price
neighbourhood
West Brighton  40.631932  80.555556

Far Rockaway ----------

                latitude       price
neighbourhood
Far Rockaway   40.597409  165.862069

South Ozone Park ----------

                   latitude  price
neighbourhood
South Ozone Park  40.672259   82.4

Tremont ----------

                latitude      price
neighbourhood
Tremont        40.843679  51.545455

Corona ----------

                latitude      price
neighbourhood
Corona         40.742901  59.171875

Great Kills ----------

                latitude  price
neighbourhood
Great Kills    40.549969  100.6

Manhattan Beach ----------

                  latitude  price
neighbourhood
Manhattan Beach  40.579365  103.5

Marble Hill ----------

                latitude      price
neighbourhood
Marble Hill    40.875741  89.166667

Dongan Hills ----------

                latitude      price
neighbourhood
Dongan Hills   40.580396  79.428571

Castleton Corners ----------

                    latitude   price
neighbourhood
Castleton Corners  40.617103  139.75

East Morrisania ----------

                  latitude  price
neighbourhood
East Morrisania  40.831259   85.0

Hunts Point ----------

                latitude  price
neighbourhood
Hunts Point    40.815522   50.5

Neponsit ----------

               latitude       price
neighbourhood
Neponsit       40.57063  274.666667

Pelham Bay ----------

               latitude  price
neighbourhood
Pelham Bay     40.84935  105.0

Randall Manor ----------

                latitude  price
neighbourhood
Randall Manor  40.632749  336.0

Throgs Neck ----------

                latitude      price
neighbourhood
Throgs Neck    40.824156  91.041667

Todt Hill ----------

                latitude  price
neighbourhood
Todt Hill      40.603375  169.0

West Farms ----------

               latitude  price
neighbourhood
West Farms     40.84135  122.0

Silver Lake ----------

                latitude  price
neighbourhood
Silver Lake    40.623395   70.0

Morrisania ----------

                latitude      price
neighbourhood
Morrisania     40.828281  83.444444

Laurelton ----------

                latitude      price
neighbourhood
Laurelton      40.675293  95.333333

Grymes Hill ----------

                latitude       price
neighbourhood
Grymes Hill    40.614849  159.142857

Holliswood ----------

                latitude   price
neighbourhood
Holliswood     40.722453  135.75

Pelham Gardens ----------

                 latitude      price
neighbourhood
Pelham Gardens  40.863684  93.607143

Belmont ----------

                latitude   price
neighbourhood
Belmont        40.855062  77.125

Rosedale ----------

                latitude      price
neighbourhood
Rosedale       40.659469  76.694915

Edgemere ----------

                latitude      price
neighbourhood
Edgemere       40.594675  94.727273

New Brighton ----------

                latitude  price
neighbourhood
New Brighton   40.642608  101.8

Midland Beach ----------

                latitude      price
neighbourhood
Midland Beach  40.573697  91.833333

Baychester ----------

                latitude      price
neighbourhood
Baychester     40.873616  75.428571

Melrose ----------

                latitude  price
neighbourhood
Melrose        40.821535   83.3

Bergen Beach ----------

                latitude  price
neighbourhood
Bergen Beach   40.623371  106.7

Richmondtown ----------

               latitude  price
neighbourhood
Richmondtown   40.57093   78.0

Howland Hook ----------

                latitude  price
neighbourhood
Howland Hook   40.631295  100.0

Schuylerville ----------

                latitude      price
neighbourhood
Schuylerville  40.835858  69.230769

Coney Island ----------

                latitude       price
neighbourhood
Coney Island   40.575939  123.705882

New Dorp Beach ----------

                 latitude  price
neighbourhood
New Dorp Beach  40.564828   57.4

Prince's Bay ----------

               latitude  price
neighbourhood
Prince's Bay    40.5257  409.5

South Beach ----------

                latitude  price
neighbourhood
South Beach    40.591201  89.25

Bath Beach ----------

                latitude      price
neighbourhood
Bath Beach     40.604134  81.764706

Jamaica Hills ----------

                latitude    price
neighbourhood
Jamaica Hills  40.713589  132.125

Oakwood ----------

                latitude  price
neighbourhood
Oakwood        40.560512   81.2

Castle Hill ----------

                latitude  price
neighbourhood
Castle Hill    40.816889   63.0

Hollis ----------

               latitude      price
neighbourhood
Hollis         40.71452  88.642857

Douglaston ----------

                latitude  price
neighbourhood
Douglaston     40.759641  82.75

Huguenot ----------

                latitude       price
neighbourhood
Huguenot       40.539467  118.333333

Olinville ----------

                latitude  price
neighbourhood
Olinville      40.883655   64.0

Edenwald ----------

                latitude  price
neighbourhood
Edenwald       40.888035   82.0

Grant City ----------

               latitude      price
neighbourhood
Grant City     40.57893  57.666667

Westerleigh ----------

                latitude  price
neighbourhood
Westerleigh    40.613895   71.5

Bay Terrace, Staten Island ----------

                             latitude  price
neighbourhood
Bay Terrace, Staten Island  40.551435  102.5

Westchester Square ----------

                    latitude  price
neighbourhood
Westchester Square  40.83969  122.2

Little Neck ----------

                latitude  price
neighbourhood
Little Neck    40.764698   75.2

Fort Wadsworth ----------

                latitude  price
neighbourhood
Fort Wadsworth  40.59546  800.0

Rosebank ----------

                latitude       price
neighbourhood
Rosebank       40.612149  111.857143

Unionport ----------

                latitude       price
neighbourhood
Unionport      40.828294  137.142857

Mill Basin ----------

                latitude   price
neighbourhood
Mill Basin     40.612382  179.75

Arden Heights ----------

               latitude  price
neighbourhood
Arden Heights  40.55241  67.25

Bull's Head ----------

               latitude      price
neighbourhood
Bull's Head    40.60115  47.333333

New Dorp ----------

               latitude  price
neighbourhood
New Dorp       40.57044   57.0

Rossville ----------

               latitude  price
neighbourhood
Rossville       40.5479   75.0

Breezy Point ----------

               latitude       price
neighbourhood
Breezy Point   40.56573  213.333333

Willowbrook ----------

               latitude  price
neighbourhood
Willowbrook    40.59886  249.0